---
title: SymbolicCurve
classe: Autodesk.Revit.DB.SymbolicCurve
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.CurveElement
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# SymbolicCurve

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsDrawnInForeground { get; set; }` | `symbolicCurve.IsDrawnInForeground` | Boolean |
| `ReferenceType ReferenceType { get; set; }` | `symbolicCurve.ReferenceType` | ReferenceType |
| `GraphicsStyle Subcategory { get; set; }` | `symbolicCurve.Subcategory` | GraphicsStyle |
| `FamilyElementVisibility GetVisibility()` | `symbolicCurve.GetVisibility()` | FamilyElementVisibility |
| `Void SetVisibility(FamilyElementVisibility)` | `symbolicCurve.SetVisibility(visibility)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```